Revit 2024 API
IExportContext.Finish Method
 This method is called at the very end of the export process, after all entities were processed (or after the process was cancelled).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void Finish()
Visual Basic
Sub Finish
Visual C++
void Finish()
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace